---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceSubFolder.IconPath
source: html/2b95fb5f-7b54-ba7e-7589-b7e28dceebce.htm
---
# Autodesk.Revit.DB.ExternalResourceSubFolder.IconPath Property

The path of the resource icon.

## Syntax (C#)
```csharp
public string IconPath { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null